"""
Напишите программу определяющую допуск ученика к зачету.
Программа должна запрашивать число учеников, затем у каждого ученика запрашивать балл за финальный тест
и в ответ печатать, допущен ли он (True или False) к зачету (необходимо набрать больше 50 баллов).
Ученикам без допуска должно печататься "Вы отчислены".
Выдачу допуска реализуй как функцию.
"""
def dopusk():
    numbers = int(input('Число учеников - '))
    for i in range(numbers):
        while numbers != 0:
            i = int(input())
            if i > 50:
                numbers -=1
                print('True')
            else:
                numbers -=1
                print('False')


dopusk()