def Price():
    print('Категории товаров:')
    print('-БАЗАР')
    print('-Животные')
    print('-Сельская Техника')
    print('-Сельские инструменты')
    kateg = input('Выберите Категорию - ')
    print('------------------------------------------------------------------------------------------------------------')
    if 'баз' in kateg or 'боз' in kateg:
        Bapar()
    if 'жив' in kateg:
        animals()
    if 'тех' in kateg:
        Selo1()
    if 'инс' in kateg:
        Selo()


def Bapar():
    List = ['Помидор - 10₽', 'Огурец - 7₽', 'Яйицо - 19₽', 'Конфеты - 399₽ (КГ)']
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')
def animals():
    List = ['Курочкa - 169₽', 'Цыплёнок - 49₽', 'Уточка - 349₽', 'Гусь - 2999₽']
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')
def Selo():
    List = ['Грабли - 219₽', 'Лейка - 199₽', 'Лопата - 249₽', 'Мотыга - 320₽',]
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')


def Selo1():
    List = ['УАЗИК - 300тыс.', 'Трактор - 5млн.', 'Комбаин - 21млн',]
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')